<?php
$flowers = array (array ( "Название" => "розы",
                            "Цена" => 100,
                            "Колличетво" => 50),
                  array ( "Название" => "тюльпаны",
                      "Цена" => 60,
                      "Колличетво" => 25),
                  array ( "Название" => "орхидеи",
                      "Цена" => 180,
                      "Колличетво" => 7)
);
echo "<h1> Ручной доступ к элементам ассоциативного массива</h1>";
for($row = 0; $row <3; $row++){
    echo $flowers[$row]["Название"]." цена ".$flowers[$row]["Цена"]." колличество ". $flowers[$row]["Колличество"];
    echo "<br>";
}

echo "<h1> Использование цикла foreach для доступа к элементам массива </h1>";
echo "<o1>";
for ($row =0; $row <3; $row++){
    echo "<li> <b> Номер строки $row </b>";
    echo "<u1>";

    foreach ($flowers[$row] as $key => $value){
        echo "<li>".$value."</li>";
    }
    echo "</u1>";
    echo "</li>";
}
echo "</o1>";
?>